БухЭксп/Catalogs/CW_ПланированиеДДС.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.20">
	<Catalog>
		<Properties>
			<Name>CW_ПланированиеДДС</Name>
			<Hierarchical>false</Hierarchical>
			<HierarchyType>HierarchyFoldersAndItems</HierarchyType>
			<BasedOn>
				<xr:Item>Document.CW_РасходыПоГрузоперевозке</xr:Item>
				<xr:Item>Document.ПоступлениеТоваровУслуг</xr:Item>
				<xr:Item>Document.СчетНаОплатуПоставщика</xr:Item>
				<xr:Item>Document.CW_ДоходыПоГрузоперевозке</xr:Item>
			</BasedOn>
		</Properties>
		<ChildObjects>
			<Attribute>
				<Properties>
					<Name>Организация</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Организации</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Сценарий</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.CW_СценарииПланированияДДС</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Подразделение</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.CW_ПодразделенияКомпании</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ВидДвижения</Name>
					<Type>
						<v8:Type>cfg:EnumRef.CW_ВидыДвиженияДДС</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Дата</Name>
					<Type>
						<v8:Type>xs:dateTime</v8:Type>
						<v8:DateQualifiers>
							<v8:DateFractions>Date</v8:DateFractions>
						</v8:DateQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>СтатьяДДС</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.CW_СтатьиДДС</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>СрокОплаты</Name>
					<Type>
						<v8:Type>xs:dateTime</v8:Type>
						<v8:DateQualifiers>
							<v8:DateFractions>Date</v8:DateFractions>
						</v8:DateQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Контролер</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Пользователи</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Автор</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Пользователи</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Валюта</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Валюты</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Контрагент</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Контрагенты</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Договор</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.ДоговорыКонтрагентов</v8:Type>
						<v8:Type>cfg:CatalogRef.CW_ДоговорыПоГрузоперевозкам</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ДокументОснование</Name>
					<Type>
						<v8:Type>cfg:DocumentRef.СписаниеСРасчетногоСчета</v8:Type>
						<v8:Type>cfg:DocumentRef.CW_ДвижениеДенежныхСредств</v8:Type>
						<v8:Type>cfg:DocumentRef.CW_ДоходыПоГрузоперевозке</v8:Type>
						<v8:Type>cfg:DocumentRef.СчетНаОплатуПоставщика</v8:Type>
						<v8:Type>cfg:DocumentRef.ПоступлениеТоваровУслуг</v8:Type>
						<v8:Type>cfg:DocumentRef.СчетНаОплатуПокупателю</v8:Type>
						<v8:Type>cfg:DocumentRef.CW_РасходыПоГрузоперевозке</v8:Type>
						<v8:Type>cfg:DocumentRef.CW_Оплата</v8:Type>
						<v8:Type>cfg:DocumentRef.РеализацияТоваровУслуг</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ОснованиеОплаты</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>150</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Сумма</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>15</v8:Digits>
							<v8:FractionDigits>2</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Оплачено</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>15</v8:Digits>
							<v8:FractionDigits>2</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Отклонение</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>15</v8:Digits>
							<v8:FractionDigits>2</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Содержание</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>0</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Комментарий</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>0</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ПланОплаты</Name>
					<Type>
						<v8:Type>xs:dateTime</v8:Type>
						<v8:DateQualifiers>
							<v8:DateFractions>Date</v8:DateFractions>
						</v8:DateQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Состояние</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>1</v8:Digits>
							<v8:FractionDigits>0</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ДатаПланирования</Name>
					<Comment>Дата планирования оплаты (согласования оплаты)</Comment>
					<Type>
						<v8:Type>xs:dateTime</v8:Type>
						<v8:DateQualifiers>
							<v8:DateFractions>DateTime</v8:DateFractions>
						</v8:DateQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Офис</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.CW_ОфисыКомпании</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Инициатор</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.ФизическиеЛица</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>СтавкаНДС</Name>
					<Type>
						<v8:Type>cfg:EnumRef.СтавкиНДС</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>СуммаНДС</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>15</v8:Digits>
							<v8:FractionDigits>2</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ВидОперацииПлатежногоПоручения</Name>
					<Type>
						<v8:Type>cfg:EnumRef.ВидыОперацийСписаниеДенежныхСредств</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ПриложениеКДоговору</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.CW_ПриложенияКДоговорам</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ВариантЗаполненияРасшифровки</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>1</v8:Digits>
							<v8:FractionDigits>0</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ПодразделениеОрганизации</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.ПодразделенияОрганизаций</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>РасчетныйСчетКонтрагента</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.БанковскиеСчета</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<TabularSection>
				<Properties>
					<Name>Расшифровка</Name>
				</Properties>
				<ChildObjects>
					<Attribute>
						<Properties>
							<Name>СтатьяБюджета</Name>
							<Type>
								<v8:Type>cfg:CatalogRef.CW_ПлановыеСтатьиЗатратИДоходов</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Грузоперевозка</Name>
							<Type>
								<v8:Type>cfg:CatalogRef.CW_Грузоперевозки</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Прогноз</Name>
							<Type>
								<v8:Type>xs:dateTime</v8:Type>
								<v8:DateQualifiers>
									<v8:DateFractions>Date</v8:DateFractions>
								</v8:DateQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Сумма</Name>
							<Type>
								<v8:Type>xs:decimal</v8:Type>
								<v8:NumberQualifiers>
									<v8:Digits>15</v8:Digits>
									<v8:FractionDigits>2</v8:FractionDigits>
								</v8:NumberQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>СуммаНДС</Name>
							<Type>
								<v8:Type>xs:decimal</v8:Type>
								<v8:NumberQualifiers>
									<v8:Digits>15</v8:Digits>
									<v8:FractionDigits>2</v8:FractionDigits>
								</v8:NumberQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Валюта</Name>
							<Type>
								<v8:Type>cfg:CatalogRef.Валюты</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>СуммаВВалютеЗаявки</Name>
							<Type>
								<v8:Type>xs:decimal</v8:Type>
								<v8:NumberQualifiers>
									<v8:Digits>15</v8:Digits>
									<v8:FractionDigits>2</v8:FractionDigits>
								</v8:NumberQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>СуммаНДСВВалютеЗаявки</Name>
							<Type>
								<v8:Type>xs:decimal</v8:Type>
								<v8:NumberQualifiers>
									<v8:Digits>15</v8:Digits>
									<v8:FractionDigits>2</v8:FractionDigits>
								</v8:NumberQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>СтавкаНДС</Name>
							<Comment>(Общ) </Comment>
							<Type>
								<v8:TypeSet>cfg:DefinedType.CW_СтавкаНДС</v8:TypeSet>
							</Type>
						</Properties>
					</Attribute>
				</ChildObjects>
			</TabularSection>
			<TabularSection>
				<Properties>
					<Name>ДополнительныеРеквизиты</Name>
				</Properties>
				<ChildObjects>
					<Attribute>
						<Properties>
							<Name>Свойство</Name>
							<Type>
								<v8:Type>cfg:ChartOfCharacteristicTypesRef.ДополнительныеРеквизитыИСведения</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Значение</Name>
							<Type>
								<v8:TypeSet>cfg:Characteristic.ДополнительныеРеквизитыИСведения</v8:TypeSet>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>ТекстоваяСтрока</Name>
							<Type>
								<v8:Type>xs:string</v8:Type>
								<v8:StringQualifiers>
									<v8:Length>0</v8:Length>
								</v8:StringQualifiers>
							</Type>
						</Properties>
					</Attribute>
				</ChildObjects>
			</TabularSection>
		</ChildObjects>
	</Catalog>
</MetaDataObject>

БухЭксп/InformationRegisters/CW_ПараметрыПланированияДДС.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.20">
	<InformationRegister>
		<Properties>
			<Name>CW_ПараметрыПланированияДДС</Name>
			<InformationRegisterPeriodicity>Day</InformationRegisterPeriodicity>
			<WriteMode>Independent</WriteMode>
		</Properties>
		<ChildObjects>
			<Resource>
				<Properties>
					<Name>ПересчитыватьСуммуПриСогласовании</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>РасходыАвтоматическоеПланирование</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>ВключатьВнутрихолдинговыеРасходы</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>РасходыСтатьяДДС</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.CW_СтатьиДДС</v8:Type>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>РасходыСтатьяДДСВнутрихолдинг</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.CW_СтатьиДДС</v8:Type>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>РасходыСценарий</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.CW_СценарииПланированияДДС</v8:Type>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>РасходыИнициаторПоЗаявке</Name>
					<Type>
						<v8:Type>cfg:EnumRef.CW_РеквизитыГрузоперевозок</v8:Type>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>ШаблонЗаполненияСодержания</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>0</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Dimension>
				<Properties>
					<Name>Организация</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Организации</v8:Type>
					</Type>
				</Properties>
			</Dimension>
		</ChildObjects>
	</InformationRegister>
</MetaDataObject>

БухЭксп/InformationRegisters/CW_СтатусыПланированиеДДС.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.20">
	<InformationRegister>
		<Properties>
			<Name>CW_СтатусыПланированиеДДС</Name>
			<InformationRegisterPeriodicity>Second</InformationRegisterPeriodicity>
			<WriteMode>Independent</WriteMode>
		</Properties>
		<ChildObjects>
			<Resource>
				<Properties>
					<Name>Статус</Name>
					<Type>
						<v8:Type>cfg:EnumRef.CW_СтатусыПланированияДДС</v8:Type>
					</Type>
				</Properties>
			</Resource>
			<Dimension>
				<Properties>
					<Name>ПланированиеДДС</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.CW_ПланированиеДДС</v8:Type>
					</Type>
				</Properties>
			</Dimension>
		</ChildObjects>
	</InformationRegister>
</MetaDataObject>

БухЭксп/Enums/CW_ВидыДвиженияДДС.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.20">
	<Enum>
		<Properties>
			<Name>CW_ВидыДвиженияДДС</Name>
		</Properties>
		<ChildObjects>
			<EnumValue>
				<Properties>
					<Name>Приход</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>Расход</Name>
				</Properties>
			</EnumValue>
		</ChildObjects>
	</Enum>
</MetaDataObject>

БухЭксп/Enums/CW_СтатусыПланированияДДС.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.20">
	<Enum>
		<Properties>
			<Name>CW_СтатусыПланированияДДС</Name>
		</Properties>
		<ChildObjects>
			<EnumValue>
				<Properties>
					<Name>Отклонена</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>План</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>Согласована</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ВОплате</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>Оплачено</Name>
				</Properties>
			</EnumValue>
		</ChildObjects>
	</Enum>
</MetaDataObject>

БухЭксп/Catalogs/CW_ПланированиеДДС/Ext/ObjectModule.bsl
#Если Сервер Или ТолстыйКлиентОбычноеПриложение Или ВнешнееСоединение Тогда

Процедура ПриКопировании(ОбъектКопирования)
	
	ЗаполнитьЗначенияСвойств(ЭтотОбъект,Новый Структура("Автор,ДатаПланирования,Контролер,ПланОплаты,Состояние,РесстрПлатежей")); 
	
	ГруппаПользователя = CW_ПраваДоступа_ПИ.ГруппаПользователя(ПараметрыСеанса.ТекущийПользователь);
	Если НЕ ГруппаПользователя.ПолныеПрава И НЕ CW_ПланированиеДДС.ИспользованиеСтатьиДДС(ГруппаПользователя,ЭтотОбъект.СтатьяДДС) Тогда
		ЭтотОбъект.СтатьяДДС = Неопределено;		
	КонецЕсли; 


КонецПроцедуры

Процедура ОбработкаЗаполнения(ДанныеЗаполнения, ТекстЗаполнения, СтандартнаяОбработка)
	
	СоответствиеВидаДвижения = ПолучитьСоответствиеВидаДвиженияТипуДокумента();
	СоответствиеВидаОперации = ПолучитьСоответствиеВидаОперацииТипуДокумента(); 
	
	Если ТипЗнч(ДанныеЗаполнения) = Тип("ДокументСсылка.CW_РасходыПоГрузоперевозке") 
		или ТипЗнч(ДанныеЗаполнения) = Тип("ДокументСсылка.CW_ДоходыПоГрузоперевозке") Тогда
		
		СуммаДокумента = ДанныеЗаполнения.СуммаДокумента - ДанныеЗаполнения.ЗачетАвансовОЗ.Итог("СуммаЗачета");
		
		Дата				= ТекущаяДата();
		Организация			= ДанныеЗаполнения.Организация;
		Контрагент			= ДанныеЗаполнения.Контрагент;
		Договор				= ДанныеЗаполнения.Договор;
		
		ДанныеПланаОплаты   = CW_Документы.ПолучитьПланОплаты(ДанныеЗаполнения);
		ПланОплаты			= ДанныеПланаОплаты.Дата;
		
		ДанныеСрокаОплаты 	= CW_Документы.ПолучитьСрокОплаты(ДанныеЗаполнения);
		СрокОплаты			= ДанныеСрокаОплаты.ДатаОплаты;   
		
		//Для версии КОРП
		ПодразделениеОрганизации	= ДанныеЗаполнения.ПодразделениеОрганизации;
		//Для версии КОРП

		//Подсистема.УчетПриложенийДоговоров	
		ПриложениеКДоговору = ДанныеЗаполнения.ПриложениеКДоговору;
		//Подсистема.УчетПриложенийДоговоров	
		
		//Параметры планирования
		ПараметрыПланирования = РегистрыСведений.CW_ПараметрыПланированияДДС.ПолучитьПараметрыПланирования(ДанныеЗаполнения.Организация,ДанныеЗаполнения.ДатаСчета);
		
		Если ПараметрыПланирования <> Неопределено Тогда 
			Если ДанныеЗаполнения.Услуги.Количество() > 0 Тогда 
				Грузоперевозка = ДанныеЗаполнения.Услуги[0].Грузоперевозка;
				Если ЗначениеЗаполнено(Грузоперевозка) Тогда
					ИмяРеквизитаИнициатор 	= ОбщегоНазначения.ИмяЗначенияПеречисления(ПараметрыПланирования.РасходыИнициаторПоЗаявке);	
					Инициатор				= Грузоперевозка[ИмяРеквизитаИнициатор];
					
					Офис				= CW_ПланированиеДДС.ПолучитьОфис(Инициатор);
					Подразделение		= CW_ПланированиеДДС.ПолучитьПодразделение(ДанныеЗаполнения, Инициатор);
				КонецЕсли;
			КонецЕсли;
		КонецЕсли;
	
		Автор				= ДанныеЗаполнения.Ответственный;
		ВидДвижения			= СоответствиеВидаДвижения.Получить(ТипЗнч(ДанныеЗаполнения));
		ДокументОснование	= ДанныеЗаполнения;
		ОснованиеОплаты		= ДанныеЗаполнения.ПредставлениеДокумента;
		
		ВидОперацииПлатежногоПоручения  = СоответствиеВидаОперации.Получить(ТипЗнч(ДанныеЗаполнения));
	
		СуммаНДСДокумента = ДанныеЗаполнения.Услуги.Итог("НДС");
		
		Если ДанныеЗаполнения.Договор.ВзаиморасчетыВУЕ Тогда
			СтруктураКурса = CW_Финансы.ПолучитьКурсВалюты(ДанныеЗаполнения.Валюта,ДанныеЗаполнения.ДатаСчета);
			
			Валюта		= Константы.ВалютаРегламентированногоУчета.Получить();
			Сумма		= СуммаДокумента * СтруктураКурса.Курс / СтруктураКурса.Кратность;
			СуммаНДС 	= СуммаНДСДокумента * СтруктураКурса.Курс / СтруктураКурса.Кратность;
		Иначе
			Валюта	 = ДанныеЗаполнения.Валюта;
			Сумма	 = СуммаДокумента;
			СуммаНДС = СуммаНДСДокумента;
		КонецЕсли; 
		
		ТаблицаУслуг = ДанныеЗаполнения.Услуги.Выгрузить();
		ТаблицаУслуг.Свернуть("СтавкаНДС", "НДС"); 
		ТаблицаУслуг.Сортировать("НДС УБЫВ");
		
		Если ТаблицаУслуг.Количество() > 0 Тогда
			СтавкаНДС = ТаблицаУслуг[0].СтавкаНДС;	
		КонецЕсли;
		
	КонецЕсли;
	
	Если ТипЗнч(ДанныеЗаполнения) = Тип("ДокументСсылка.СчетНаОплатуПоставщика") Тогда
		
		//Параметры планирования
		ПараметрыПланирования = РегистрыСведений.CW_ПараметрыПланированияДДС.ПолучитьПараметрыПланирования(ДанныеЗаполнения.Организация,ДанныеЗаполнения.ДатаВходящегоДокумента);
		
		//Параметры планирования
		СуммаДокумента = ДанныеЗаполнения.СуммаДокумента;
		
		Дата		= ТекущаяДата();
		Организация	= ДанныеЗаполнения.Организация;
		Контрагент	= ДанныеЗаполнения.Контрагент;
		Договор		= ДанныеЗаполнения.ДоговорКонтрагента;
		Инициатор	= ПараметрыСеанса.ТекущийПользователь.ФизическоеЛицо;

		//Для версии КОРП
		ПодразделениеОрганизации	= ДанныеЗаполнения.ПодразделениеОрганизации;
		//Для версии КОРП
		
		Если ПараметрыПланирования <> Неопределено Тогда 
			Офис				= CW_ПланированиеДДС.ПолучитьОфис(Инициатор);
			Подразделение		= CW_ПланированиеДДС.ПолучитьПодразделение(ДанныеЗаполнения, Инициатор);
		КонецЕсли;
		
		СрокОплаты = СрокиОплатыДокументов.УстановленныйСрокОплаты(ДанныеЗаполнения.Ссылка, ДанныеЗаполнения.Организация);

		Автор				= ДанныеЗаполнения.Ответственный;
		ВидДвижения			= СоответствиеВидаДвижения.Получить(ТипЗнч(ДанныеЗаполнения));
		ДокументОснование	= ДанныеЗаполнения;
		
		ОснованиеОплаты		= "Счет №"+ДанныеЗаполнения.НомерВходящегоДокумента + " от "+Формат(ДанныеЗаполнения.ДатаВходящегоДокумента, "ДФ=dd.MM.yyyy");
		
		ВидОперацииПлатежногоПоручения  = СоответствиеВидаОперации.Получить(ТипЗнч(ДанныеЗаполнения));
	
		СуммаНДСДокумента = ДанныеЗаполнения.Товары.Итог("СуммаНДС");
		
		Если Договор.РасчетыВУсловныхЕдиницах Тогда
			СтруктураКурса = CW_Финансы.ПолучитьКурсВалюты(ДанныеЗаполнения.ВалютаДокумента,ДанныеЗаполнения.ДатаВходящегоДокумента);
			
			Валюта		= Константы.ВалютаРегламентированногоУчета.Получить();
			Сумма		= СуммаДокумента * СтруктураКурса.Курс / СтруктураКурса.Кратность;
			СуммаНДС 	= СуммаНДСДокумента * СтруктураКурса.Курс / СтруктураКурса.Кратность;
		Иначе
			Валюта	 = ДанныеЗаполнения.ВалютаДокумента;
			Сумма	 = СуммаДокумента;
			СуммаНДС = СуммаНДСДокумента;
		КонецЕсли; 
		
		ТаблицаТовары = ДанныеЗаполнения.Товары.Выгрузить();
		ТаблицаТовары.Свернуть("СтавкаНДС", "СуммаНДС"); 
		ТаблицаТовары.Сортировать("СуммаНДС УБЫВ");
		
		Если ТаблицаТовары.Количество() > 0 Тогда
			СтавкаНДС = ТаблицаТовары[0].СтавкаНДС;	
		КонецЕсли;
	
	КонецЕсли;
	
	Если ТипЗнч(ДанныеЗаполнения) = Тип("ДокументСсылка.ПоступлениеТоваровУслуг") Тогда
		//Параметры планирования
		
		ПараметрыПланирования = РегистрыСведений.CW_ПараметрыПланированияДДС.ПолучитьПараметрыПланирования(ДанныеЗаполнения.Организация,ДанныеЗаполнения.ДатаВходящегоДокумента);
	
		//Параметры планирования
		СуммаДокумента = ДанныеЗаполнения.СуммаДокумента - ДанныеЗаполнения.ЗачетАвансов.Итог("СуммаЗачета");
		
		Дата		= ТекущаяДата();
		Организация	= ДанныеЗаполнения.Организация;
		Контрагент	= ДанныеЗаполнения.Контрагент;
		Договор		= ДанныеЗаполнения.ДоговорКонтрагента;
		Инициатор	= ПараметрыСеанса.ТекущийПользователь.ФизическоеЛицо;
		
		//Для версии КОРП
		ПодразделениеОрганизации	= ДанныеЗаполнения.ПодразделениеОрганизации;
		//Для версии КОРП

		Если ПараметрыПланирования <> Неопределено Тогда 
			Офис				= CW_ПланированиеДДС.ПолучитьОфис(Инициатор);
			Подразделение		= CW_ПланированиеДДС.ПолучитьПодразделение(ДанныеЗаполнения, Инициатор);
		КонецЕсли;

		Автор				= ДанныеЗаполнения.Ответственный;
		ВидДвижения			= СоответствиеВидаДвижения.Получить(ТипЗнч(ДанныеЗаполнения));
		ДокументОснование	= ДанныеЗаполнения;
		
		СтруктураСрокОплаты = СрокиОплатыДокументов.СрокОплатыДокументаРасчетов(
								ДанныеЗаполнения.Организация, ДанныеЗаполнения.Ссылка, ДанныеЗаполнения.Дата, ДанныеЗаполнения.ДоговорКонтрагента);

		СрокОплаты			=  СтруктураСрокОплаты.СрокОплаты;
		
		ОснованиеОплаты		= "Акт №"+ДанныеЗаполнения.НомерВходящегоДокумента + " от "+Формат(ДанныеЗаполнения.ДатаВходящегоДокумента, "ДФ=dd.MM.yyyy");
		
		ВидОперацииПлатежногоПоручения  = СоответствиеВидаОперации.Получить(ТипЗнч(ДанныеЗаполнения));
		
		СуммаНДСДокумента = ДанныеЗаполнения.Оборудование.Итог("СуммаНДС") 
							+ ДанныеЗаполнения.ОбъектыСтроительства.Итог("СуммаНДС") 
							+ ДанныеЗаполнения.Товары.Итог("СуммаНДС")
							+ ДанныеЗаполнения.Услуги.Итог("СуммаНДС")
							+ ДанныеЗаполнения.АгентскиеУслуги.Итог("СуммаНДС")
							+ ДанныеЗаполнения.ОсновныеСредства.Итог("СуммаНДС")
							+ ДанныеЗаполнения.Топливо.Итог("СуммаНДС");
		
		Если Договор.РасчетыВУсловныхЕдиницах Тогда
			СтруктураКурса = CW_Финансы.ПолучитьКурсВалюты(ДанныеЗаполнения.ВалютаДокумента,ДанныеЗаполнения.ДатаВходящегоДокумента);
			
			Валюта		= Константы.ВалютаРегламентированногоУчета.Получить();
			Сумма		= СуммаДокумента * СтруктураКурса.Курс / СтруктураКурса.Кратность;
			СуммаНДС 	= СуммаНДСДокумента * СтруктураКурса.Курс / СтруктураКурса.Кратность;
		Иначе
			Валюта	 = ДанныеЗаполнения.ВалютаДокумента;
			Сумма	 = СуммаДокумента;
			СуммаНДС = СуммаНДСДокумента;
		КонецЕсли;		
		
		ТаблицаСтавок = Новый ТаблицаЗначений;
		ТаблицаСтавок.Колонки.Добавить("СтавкаНДС", Новый ОписаниеТипов("ПеречислениеСсылка.СтавкиНДС"));
		ТаблицаСтавок.Колонки.Добавить("СуммаНДС",  Новый ОписаниеТипов("Число"));
		
		ОбщегоНазначенияКлиентСервер.ДополнитьТаблицу(ДанныеЗаполнения.Оборудование.Выгрузить(),			ТаблицаСтавок); 
		ОбщегоНазначенияКлиентСервер.ДополнитьТаблицу(ДанныеЗаполнения.ОбъектыСтроительства.Выгрузить(),	ТаблицаСтавок); 
		ОбщегоНазначенияКлиентСервер.ДополнитьТаблицу(ДанныеЗаполнения.Товары.Выгрузить(),					ТаблицаСтавок); 
		ОбщегоНазначенияКлиентСервер.ДополнитьТаблицу(ДанныеЗаполнения.Услуги.Выгрузить(),					ТаблицаСтавок); 
		ОбщегоНазначенияКлиентСервер.ДополнитьТаблицу(ДанныеЗаполнения.АгентскиеУслуги.Выгрузить(),			ТаблицаСтавок); 
		ОбщегоНазначенияКлиентСервер.ДополнитьТаблицу(ДанныеЗаполнения.ОсновныеСредства.Выгрузить(),		ТаблицаСтавок); 
		ОбщегоНазначенияКлиентСервер.ДополнитьТаблицу(ДанныеЗаполнения.Топливо.Выгрузить(),					ТаблицаСтавок); 
		
		ТаблицаСтавок.Свернуть("СтавкаНДС", "СуммаНДС"); 
		ТаблицаСтавок.Сортировать("СуммаНДС УБЫВ");
		
		Если ТаблицаСтавок.Количество() > 0 Тогда
			СтавкаНДС = ТаблицаСтавок[0].СтавкаНДС;	
		КонецЕсли;

	КонецЕсли;
	
	Если ТипЗнч(ДанныеЗаполнения) = Тип("Структура")
		И ДанныеЗаполнения.Свойство("ВидДвижения") Тогда   
		ВидДвижения = ДанныеЗаполнения.ВидДвижения; 	
	КонецЕсли; 
	
	Если ВидДвижения =  Перечисления.CW_ВидыДвиженияДДС.Приход Тогда
		СтатьяДДС = Константы.CW_ОсновнаяСтатьяДДСДляПоступления.Получить();
	КонецЕсли;
	Если ВидДвижения =  Перечисления.CW_ВидыДвиженияДДС.Расход Тогда
		СтатьяДДС = Константы.CW_ОсновнаяСтатьяДДСДляСписания.Получить();
	КонецЕсли;
	
КонецПроцедуры

Процедура ПриУстановкеНовогоКода(СтандартнаяОбработка, Префикс)
	
	ШаблонПрефикса = "[ОР][ГД]-";
	
	ПрефиксОргаиазции 	= ?(ЗначениеЗаполнено(Организация.Префикс), СокрЛП(Организация.Префикс),"ОО"); 
	ПрефиксГода 		= ?(ЗначениеЗаполнено(Дата), Формат(Дата,"ДФ=гг"),Формат(ТекущаяДата(),"ДФ=гг"));
	
	
	Префикс = СтрЗаменить(ШаблонПрефикса, 	"[ОР]", ПрефиксОргаиазции);
	Префикс = СтрЗаменить(Префикс, 			"[ГД]", ПрефиксГода);
	
КонецПроцедуры

Процедура ПриЗаписи(Отказ)
	
	Если ПометкаУдаления Тогда
		
		Запрос = Новый Запрос;
		Запрос.Текст = "ВЫБРАТЬ
		               |	CW_СтатьиПланированияПоРеестрам.Ссылка КАК Ссылка
		               |ИЗ
		               |	КритерийОтбора.CW_СтатьиПланированияПоРеестрам(&Статья) КАК CW_СтатьиПланированияПоРеестрам";
		Запрос.УстановитьПараметр("Статья", Ссылка);
		
		РезультатЗапроса = Запрос.Выполнить();
		
		Если Не РезультатЗапроса.Пустой() Тогда
			Отказ = истина;
			ОбщегоНазначенияКлиентСервер.СообщитьПользователю("Заявка включена в реестр. Пометка на удаление невозможна!");
			Возврат;
		КонецЕсли;
		
		ТекущийСтатус = РегистрыСведений.CW_СтатусыПланированиеДДС.ПолучитьСтатусПланированияДДС(Ссылка);
		
		Если ТекущийСтатус = ПредопределенноеЗначение("Перечисление.CW_СтатусыПланированияДДС.Согласована") Тогда
			Отказ = истина;
			ОбщегоНазначенияКлиентСервер.СообщитьПользователю("Нельзя пометить на удаление заявку в статусе 'Согласована'");
			Возврат;
		КонецЕсли;
		
		Набор = РегистрыСведений.CW_СтатусыПланированиеДДС.СоздатьНаборЗаписей();
		Набор.Отбор.ПланированиеДДС.Установить(Ссылка);
		Набор.Прочитать();
		Набор.Очистить();
		Набор.Записать(Истина);
		
	КонецЕсли;
	
	
	
КонецПроцедуры

Функция  ПолучитьСоответствиеВидаДвиженияТипуДокумента()
	
	Результат = Новый Соответствие;
	Результат.Вставить(Тип("ДокументСсылка.CW_РасходыПоГрузоперевозке")	,  ПредопределенноеЗначение("Перечисление.CW_ВидыДвиженияДДС.Расход"));
	Результат.Вставить(Тип("ДокументСсылка.ПоступлениеТоваровУслуг")	,  ПредопределенноеЗначение("Перечисление.CW_ВидыДвиженияДДС.Расход"));
	Результат.Вставить(Тип("ДокументСсылка.СчетНаОплатуПоставщика")		,  ПредопределенноеЗначение("Перечисление.CW_ВидыДвиженияДДС.Расход"));
	Результат.Вставить(Тип("ДокументСсылка.CW_ДоходыПоГрузоперевозке")	,  ПредопределенноеЗначение("Перечисление.CW_ВидыДвиженияДДС.Приход"));
	
	Возврат Результат;
	
КонецФункции

Функция ПолучитьСоответствиеВидаОперацииТипуДокумента()
	
	Результат = Новый Соответствие;
	Результат.Вставить(Тип("ДокументСсылка.CW_РасходыПоГрузоперевозке")	, ПредопределенноеЗначение("Перечисление.ВидыОперацийСписаниеДенежныхСредств.ОплатаПоставщику"));
	Результат.Вставить(Тип("ДокументСсылка.ПоступлениеТоваровУслуг")	, ПредопределенноеЗначение("Перечисление.ВидыОперацийСписаниеДенежныхСредств.ОплатаПоставщику"));
	Результат.Вставить(Тип("ДокументСсылка.СчетНаОплатуПоставщика")		, ПредопределенноеЗначение("Перечисление.ВидыОперацийСписаниеДенежныхСредств.ОплатаПоставщику"));
	Результат.Вставить(Тип("ДокументСсылка.CW_ДоходыПоГрузоперевозке")	, Неопределено);
	
	Возврат Результат;
	
КонецФункции

Процедура ОбработкаПроверкиЗаполнения(Отказ, ПроверяемыеРеквизиты)
	
	Если ВидДвижения = ПредопределенноеЗначение("Перечисление.CW_ВидыДвиженияДДС.Приход") Тогда
		ОбщегоНазначенияКлиентСервер.УдалитьЗначениеИзМассива(ПроверяемыеРеквизиты, "ВидОперацииПлатежногоПоручения");
	КонецЕсли;
	
КонецПроцедуры
#КонецЕсли
